# Case Study - Country Club

### PART 1: PHPMyAdmin

/* QUESTIONS 
/* Q1: Some of the facilities charge a fee to members, but some do not.
Write a SQL query to produce a list of the names of the facilities that do. */

--A1:
-- Facilites that charge member cost
SELECT name, membercost
FROM Facilities
WHERE 
	membercost IS NOT NULL AND
	membercost > 0

/* Q2: How many facilities do not charge a fee to members? */

--A2:
-- Facilites that DO NOT charge member cost
SELECT name, membercost
FROM Facilities
WHERE 
	membercost IS NULL OR
	membercost = 0



/* Q3: Write an SQL query to show a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost.
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question. */

--A3:
-- Facilites that charge member cost and fee is < 20% of maint cost
SELECT facid, name, membercost, monthlymaintenance
FROM Facilities
WHERE 
	membercost IS NOT NULL AND
	membercost > 0 AND
	membercost < (.2 * monthlymaintenance)

/* Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5.
Try writing the query without using the OR operator. */

--A4:
-- Show facilities with ID 1 and 5 w/o using OR
SELECT *
FROM Facilities
WHERE facid IN (1, 5)


/* Q5: Produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100. Return the name and monthly maintenance of the facilities
in question. */

-- A5
-- Show facilities labelled as cheap or expensive (maint cost > $100)
SELECT 
	name, 
	monthlymaintenance,
	CASE
		WHEN monthlymaintenance <= 100 THEN 'Cheap'
		ELSE 'Expensive' END AS cost_category
FROM Facilities

/* Q6: You'd like to get the first and last name of the last member(s)
who signed up. Try not to use the LIMIT clause for your solution. */

-- A6
-- Show first and last name of newest member w/o using LIMIT command
SELECT firstname, surname, MAX(joindate)
FROM Members
WHERE surname != 'GUEST' --excluding guest because I assume they are not "member"s

/* Q7: Produce a list of all members who have used a tennis court.
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name. */

--A7:
-- Show members who used the tennis court. SELECT court name, fullname. No dups. Order by member name
SELECT f.name, m.surname, m.firstname
FROM Members AS m
INNER JOIN Bookings AS b
	ON m.memid = b.memid
INNER JOIN Facilities AS f
	ON f.facid = b.facid
WHERE f.name LIKE 'Tennis Court%'
GROUP BY f.name
ORDER BY m.surname, m.firstname
#THE CONCAT FUNCTION IS CONTINUALLY ERRORING OUT

/* Q8: Produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30. Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries. */


--A8:
-- List of bookings for 2012-09-14 costing > $30 for member or guest
SELECT 
	f.name, 
	CONCAT(m.surname, ' ', m.firstname),
	CASE 
		WHEN m.memid = 0 THEN f.guestcost
		ELSE f.membercost
		END AS cost,
	b.starttime
FROM Members AS m
INNER JOIN Bookings AS b
	ON m.memid = b.memid
INNER JOIN Facilities AS f
	ON f.facid = b.facid
WHERE ((f.guestcost > 30 AND m.memid = 0) OR (f.membercost > 30 AND m.memid != 0)) AND
	b.starttime BETWEEN '2012-09-14' AND '2012-09-15'
ORDER BY cost DESC

/* Q9: This time, produce the same result as in Q8, but using a subquery. */
--A9:

-- List of bookings for 2012-09-14 costing > $30 for member or guest
SELECT 
	f.name, 
	CONCAT(m.surname, ' ', m.firstname),
	CASE 
		WHEN m.memid = 0 THEN f.guestcost
		ELSE f.membercost
		END AS cost,
	b.starttime
FROM Members AS m
INNER JOIN Bookings AS b
	ON m.memid = b.memid
INNER JOIN Facilities AS f
	ON f.facid = b.facid
WHERE ((f.guestcost > 30 AND m.memid = 0) OR (f.membercost > 30 AND m.memid != 0)) 
	AND b.starttime in (
		SELECT starttime 
        FROM Bookings
        WHERE starttime BETWEEN '2012-09-14' AND '2012-09-15'
        )
ORDER BY cost DESC

### PART 2\: SQLite
Export the country club data from PHPMyAdmin, and connect to a local SQLite instance from Jupyter notebook for the following questions.

#### QUESTIONS\:
- (Q10) Produce a list of facilities with a total revenue less than 1000. The output of facility name and total revenue, sorted by revenue. Remember that there's a different cost for guests and members!
- (Q11) Produce a report of members and who recommended them in alphabetic surname,firstname order
- (Q12) Find the facilities with their usage by member, but not guests
- (Q13) Find the facilities usage by month, but not guests

#### Test local SQLite instance using script

In [1]:
! python .\LocalSQLConnection.py

2.6.0
2. Query all tasks
(0, 'Tennis Court 1', 5, 25, 10000, 200)
(1, 'Tennis Court 2', 5, 25, 8000, 200)
(2, 'Badminton Court', 0, 15.5, 4000, 50)
(3, 'Table Tennis', 0, 5, 320, 10)
(4, 'Massage Room 1', 9.9, 80, 4000, 3000)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)
(6, 'Squash Court', 3.5, 17.5, 5000, 80)
(7, 'Snooker Table', 0, 5, 450, 15)
(8, 'Pool Table', 0, 5, 400, 15)

#### Connect to local SQLite instance

In [2]:
#SQLAlchemy keeps throwing errors for everything. Trying SQLite instead...
import sqlite3

#connect to db
conn = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = conn.cursor()

#test connection with a simple query
cursor.execute("SELECT * FROM Bookings LIMIT 10")
cursor.fetchall()

[(0, 3, 1, '2012-07-03 11:00:00', 2),
 (1, 4, 1, '2012-07-03 08:00:00', 2),
 (2, 6, 0, '2012-07-03 18:00:00', 2),
 (3, 7, 1, '2012-07-03 19:00:00', 2),
 (4, 8, 1, '2012-07-03 10:00:00', 1),
 (5, 8, 1, '2012-07-03 15:00:00', 1),
 (6, 0, 2, '2012-07-04 09:00:00', 3),
 (7, 0, 2, '2012-07-04 15:00:00', 3),
 (8, 4, 3, '2012-07-04 13:30:00', 2),
 (9, 4, 0, '2012-07-04 15:00:00', 2)]

#### Q10 - Display facilities with total revenue < 1000. Sort by revenue.

In [3]:
# Q10. Produce a list of facilities with a total revenue less than 1000. 
#      The output of facility name and total revenue, sorted by revenue. 
#      Remember that there's a different cost for guests 
query = 'SELECT f.name, SUM(membercost) AS MemberRevenue, SUM(guestcost) AS GuestRevenue,  (SUM(membercost) + SUM(guestcost)) AS TOTALRevenue FROM Facilities AS f LEFT JOIN Bookings AS b ON f.facid = b.facid WHERE "TOTAL Revenue" < 1000 GROUP BY f.name'
cursor.execute(query)
cursor.fetchall()

#No facilites have less than 1000 revenue from what I can tell
#HOW IS TOTAL REVENUE DEFINED??

[]

#### Q11 - Display list of members and who recommended them

In [4]:
#(Q11) Produce a report of members and who recommended them in alphabetic surname,firstname order
query = 'SELECT m.surname, m.firstname, m.recommendedby, rec.surname AS RecommendBySurname, rec.firstname as RecommendByFirstname FROM Members AS m LEFT JOIN Members AS rec ON m.recommendedby = rec.memid ORDER BY RecommendBySurname, RecommendByFirstname'
cursor.execute(query)
cursor.fetchall()

[('GUEST', 'GUEST', '', None, None),
 ('Smith', 'Darren', '', None, None),
 ('Smith', 'Tracy', '', None, None),
 ('Rownam', 'Tim', '', None, None),
 ('Tracy', 'Burton', '', None, None),
 ('Farrell', 'Jemima', '', None, None),
 ('Farrell', 'David', '', None, None),
 ('Tupperware', 'Hyacinth', '', None, None),
 ('Smith', 'Darren', '', None, None),
 ('Sarwin', 'Ramnaresh', '15', 'Bader', 'Florence'),
 ('Coplin', 'Joan', '16', 'Baker', 'Timothy'),
 ('Genting', 'Matthew', '5', 'Butters', 'Gerald'),
 ('Baker', 'Timothy', '13', 'Farrell', 'Jemima'),
 ('Pinker', 'David', '13', 'Farrell', 'Jemima'),
 ('Rumney', 'Henrietta', '20', 'Genting', 'Matthew'),
 ('Jones', 'Douglas', '11', 'Jones', 'David'),
 ('Dare', 'Nancy', '4', 'Joplette', 'Janice'),
 ('Jones', 'David', '4', 'Joplette', 'Janice'),
 ('Hunt', 'John', '30', 'Purview', 'Millicent'),
 ('Boothe', 'Tim', '3', 'Rownam', 'Tim'),
 ('Joplette', 'Janice', '1', 'Smith', 'Darren'),
 ('Butters', 'Gerald', '1', 'Smith', 'Darren'),
 ('Owen', 'Charles', '1', 'Smith', 'Darren'),
 ('Smith', 'Jack', '1', 'Smith', 'Darren'),
 ('Mackenzie', 'Anna', '1', 'Smith', 'Darren'),
 ('Worthington-Smyth', 'Henry', '2', 'Smith', 'Tracy'),
 ('Purview', 'Millicent', '2', 'Smith', 'Tracy'),
 ('Crumpet', 'Erica', '2', 'Smith', 'Tracy'),
 ('Baker', 'Anne', '9', 'Stibbons', 'Ponder'),
 ('Bader', 'Florence', '9', 'Stibbons', 'Ponder'),
 ('Stibbons', 'Ponder', '6', 'Tracy', 'Burton')]

#### (Q12) Find the facilities with their usage by member, but not guests

In [5]:
#(Q12) 
query = 'SELECT  m.surname, m.firstname, f.name, b.starttime, b.slots FROM Facilities AS f INNER JOIN Bookings AS b ON f.facid = b.facid INNER JOIN Members AS m ON b.memid = b.facid WHERE m.memid != 0 GROUP BY m.surname, m.firstname'
cursor.execute(query)
cursor.fetchall()

[('Bader', 'Florence', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Baker', 'Anne', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Baker', 'Timothy', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Boothe', 'Tim', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Butters', 'Gerald', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Coplin', 'Joan', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Crumpet', 'Erica', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Dare', 'Nancy', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Farrell', 'David', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Farrell', 'Jemima', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Genting', 'Matthew', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Hunt', 'John', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Jones', 'David', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Jones', 'Douglas', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Joplette', 'Janice', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Mackenzie', 'Anna', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Owen', 'Charles', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Pinker', 'David', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Purview', 'Millicent', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Rownam', 'Tim', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Rumney', 'Henrietta', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Sarwin', 'Ramnaresh', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Smith', 'Darren', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Smith', 'Jack', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Smith', 'Tracy', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Stibbons', 'Ponder', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Tracy', 'Burton', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Tupperware', 'Hyacinth', 'Table Tennis', '2012-07-05 09:00:00', 2),
 ('Worthington-Smyth', 'Henry', 'Table Tennis', '2012-07-05 09:00:00', 2)]

#### (Q13) Find the facilities usage by month, but not guests

In [6]:
#(Q13)
query = 'SELECT f.name, strftime("%m", b.starttime) AS Month, SUM(b.slots) AS TotalSlots FROM Bookings AS b LEFT JOIN Facilities AS f ON f.facid = b.facid INNER JOIN Members AS m ON m.memid = b.memid WHERE m.memid != 0 GROUP BY Month'
cursor.execute(query)
cursor.fetchall()

[('Table Tennis', '07', 1061),
 ('Tennis Court 1', '08', 2531),
 ('Tennis Court 1', '09', 3199)]

In [7]:
#close sqlite connection
conn.close()